<template>
  <div>
    <v-dialog v-model="viewHistory2016" :width="width">
      <v-sheet class="px-3 py-1 teal lighten-4">
        <mu-history2016/>
      </v-sheet>
    </v-dialog>

    <v-dialog v-model="viewHistory2018" :width="width">
      <v-sheet class="px-3 py-1 teal lighten-4">
        <mu-history2018/>
      </v-sheet>
    </v-dialog>

    <v-row dense>
      <v-col cols="3" lg="2" class="mx-auto">
        <v-img src="uefa2020.png"/>
      </v-col>

      <v-col cols="11" class="mx-auto">
        <h3 class="text-center">Друзья!</h3>

        <p>
          Похоже, что всё-таки <b>чемпионат Европы по футболу 2020</b> состоится! Пусть и не в 2020 году, зато со зрителями.
        </p>

        <p>
          И, конечно же, я рад снова привествовать всех вас в нашем клубе!
        </p>

        <p>
          С точки зрения организацции у нас тут всё по-прежнему: потенциальному участнику нашего проекта я высылаю письмо со ссылкой для
          регистрации, и после её успешного прохождения вы становитесь членом клуба! Но, чтобы принять <b>полноценное участие</b> в нашем мероприятии,
          необходимо (как во всех <b>приличных</b> клубах) оплатить свой членский билет 😊. А вот уже после этого вы получаете <b>полный</b> доступ
          к функционалу сайта.
        </p>

        <p>
          Изменился и порядок расчёта баллов за ставку.
        </p>

        <p>
          Более подробную информацию читайте на странице <b>"Правила"</b>.
        </p>

        <p>
          Эта версия написана с использованием других технологий, чем предыдущие. Это позволяет, фактически в режиме <b>online</b>, отображать
          результаты матчей, тотализатора, набранные участниками очки и список победителей на <b>текущий момент</b>.
        </p>

        <p>
          Но всё-таки, это всё ещё сайт, а не мобильное приложение. Поэтому, главным образом, оно ориентировано на ПК, ноутбуки и планшеты. Я
          понимаю, что, возможно, <b>только я один</b> из всех участников и буду пользоваться этими устойствами 😊. Однако, <b>конечно же</b>, весь
          функционал доступен и с мобильных телефонов. Просто хочу обратить ваше внимание на иконки в виде руки с указательным пальцем,
          расположенные в левом и правом верхних углах. Нажатие на эти указатели открывает/закрывает панели <b>меню</b> и <b>таблицы результатов
          участников</b>, которые могут быть изначально скрыты на вашем гаджете.
        </p>

        <p>
          Для тех, кто впервые попал в наш клуб, скажу, что уже более <b>10 лет</b> мы организуем этот турнир во время проведения чемпионатов мира
          и Европы по футболу. Здесь
          (<span class="anchor indigo--text" @click="viewHistory2016 = true">2016 год</span>,
          <span class="anchor indigo--text" @click="viewHistory2018 = true">2018 год</span>)
          вы можете посмотреть стартовые страницы двух предыдущих сайтов.
        </p>

        <p>
          И <b>обязательно</b> не забываем писать свои комментарии в чате! Ведь, по большому счёту, собрались мы здесь не ради потенциального
          выигрыша, а чтобы интереснее было смотреть <b>футбол</b>!
        </p>

        <p class="font-italic text-right caption cyan--text text--darken-3">
          Кстати, в чате доступна функция <b>цитирования</b>. Для этого надо щёлкнуть по сообщению, на которое хотите ответить, и его часть, по
          аналогии с популярными messengers, вставляется (цитируется) в ваше сообщение.
        </p>

        <h3 class="text-center">Всем приятного просмотра и удачных ставок!</h3>
      </v-col>
    </v-row>
  </div>
</template>

<script>
import MuHistory2018 from '../components/History2018'
import MuHistory2016 from '../components/History2016'

export default {
  name: 'uefa2020',
  components: {
    MuHistory2018,
    MuHistory2016
  },
  data() {
    return {
      viewHistory2016: false,
      viewHistory2018: false
    }
  },
  computed: {
    width() {
      let width = '';
      switch (this.$vuetify.breakpoint.name) {
        case 'lg':
          width = '70%';
          break;
        case 'md':
          width = '75%';
          break;
        case 'sm':
          width = '80%';
          break;
        case 'xs':
          width = '90%';
          break;
        default:
          width = '60%'
      }

      return width
    },
  }
}
</script>

<style lang="scss" scoped>
.anchor {
  text-decoration: underline;
  cursor: pointer;
}
</style>
